; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl)

(:types link joint angle)

(:predicates
	(Connected ?j - joint ?l - link) 
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?a - angle ?j - joint)
)

(:action increase_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(Connected ?joint ?link1)
	(Connected ?joint ?link2)
	(not (= ?link1 ?link2))
	(HasAngle ?a1 ?joint)
	(AngleOrd ?a1 ?a2)
	)
:effect (and 
	(not (HasAngle ?a1 ?joint)) 
	(HasAngle ?a2 ?joint)
	)
)

(:action decrease_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(Connected ?joint ?link1)
	(Connected ?joint ?link2)
	(not (= ?link1 ?link2))
	(HasAngle ?a1 ?joint)
	(AngleOrd ?a2 ?a1)
	)
:effect (and 
	(not (HasAngle ?a1 ?joint)) 
	(HasAngle ?a2 ?joint)
	)
)
)

; problem
(define (problem joint_bar_2)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 - link
    joint1 joint2 joint3 joint4 joint5 joint6 - joint
    angle0 angle45 angle90 angle135 angle180 angle225 angle270 angle315 - angle)
(:init
    (AngleOrd angle0 angle45)
    (AngleOrd angle45 angle90)
    (AngleOrd angle90 angle135)
    (AngleOrd angle135 angle180)
    (AngleOrd angle180 angle225)
    (AngleOrd angle225 angle270)
    (AngleOrd angle270 angle315)
    (AngleOrd angle315 angle0)

    (Connected joint1 link1)
    (Connected joint1 link2)
    (Connected joint2 link2)
    (Connected joint2 link3)
    (Connected joint3 link3)
    (Connected joint3 link4)
    (Connected joint4 link4)
    (Connected joint4 link5)
    (Connected joint5 link5)
    (Connected joint5 link6)
    (Connected joint6 link6)
    (Connected joint6 link7)

    (HasAngle angle315 joint1)
    (HasAngle angle135 joint2)
    (HasAngle angle0 joint3)
    (HasAngle angle90 joint4)
    (HasAngle angle225 joint5)
    (HasAngle angle90 joint6)
)
(:goal
(and
    (HasAngle angle225 joint1)
    (HasAngle angle180 joint2)
    (HasAngle angle180 joint3)
    (HasAngle angle180 joint4)
    (HasAngle angle270 joint5)
    (HasAngle angle90 joint6)
    )
)
)

; plan
1. (decrease_angle link1 link2 joint1 angle315 angle270)
   deleted: (hasangle angle315 joint1)
   added: (hasangle angle270 joint1)
   goals met: 1 of 6
2. (decrease_angle link3 link4 joint3 angle0 angle315)
   deleted: (hasangle angle0 joint3)
   added: (hasangle angle315 joint3)
   goals met: 1 of 6
3. (increase_angle link3 link2 joint2 angle135 angle180)
   deleted: (hasangle angle135 joint2)
   added: (hasangle angle180 joint2)
   goals met: 2 of 6
4. (increase_angle link4 link5 joint4 angle90 angle135)
   deleted: (hasangle angle90 joint4)
   added: (hasangle angle135 joint4)
   goals met: 2 of 6
5. (increase_angle link5 link6 joint5 angle225 angle270)
   deleted: (hasangle angle225 joint5)
   added: (hasangle angle270 joint5)
   goals met: 3 of 6
6. (decrease_angle link1 link2 joint1 angle270 angle225)
   deleted: (hasangle angle270 joint1)
   added: (hasangle angle225 joint1)
   goals met: 4 of 6
7. (decrease_angle link3 link4 joint3 angle315 angle270)
   deleted: (hasangle angle315 joint3)
   added: (hasangle angle270 joint3)
   goals met: 4 of 6
8. (increase_angle link5 link4 joint4 angle135 angle180)
   deleted: (hasangle angle135 joint4)
   added: (hasangle angle180 joint4)
   goals met: 5 of 6
9. (decrease_angle link4 link3 joint3 angle270 angle225)
   deleted: (hasangle angle270 joint3)
   added: (hasangle angle225 joint3)
   goals met: 5 of 6
10. (decrease_angle link3 link4 joint3 angle225 angle180)
   deleted: (hasangle angle225 joint3)
   added: (hasangle angle180 joint3)
   goals met: 6 of 6
